Revit 2027 API
BuiltInFailures.SiteImportFailures.TooFarAway Property
 Imported Toposolid Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooFarAway { get; }
Public Shared ReadOnly Property TooFarAway As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooFarAway {
	FailureDefinitionId^ get ();
}
static member TooFarAway : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace